Revit 2027 API
ExternalServices.BuiltInExternalServices.CodeCheckingParameterService Property
 The external service supporting view and modification of the structural code checking parameter in analytical elements. To use this service, programmers implement a server class that derives from ICodeCheckingParameterServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId CodeCheckingParameterService { get; }
Public Shared ReadOnly Property CodeCheckingParameterService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ CodeCheckingParameterService {
	ExternalServiceId^ get ();
}
static member CodeCheckingParameterService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace